Filip1159/STM32F429-playground/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ST7735S_SCK_Pin GPIO_PIN_2
#define ST7735S_SCK_GPIO_Port GPIOE
#define ST7735S_RST_Pin GPIO_PIN_3
#define ST7735S_RST_GPIO_Port GPIOE
#define ST7735S_MOSI_Pin GPIO_PIN_6
#define ST7735S_MOSI_GPIO_Port GPIOE
#define USER_Btn_Pin GPIO_PIN_13
#define USER_Btn_GPIO_Port GPIOC
#define USER_Btn_EXTI_IRQn EXTI15_10_IRQn
#define BUZZER_Pin GPIO_PIN_2
#define BUZZER_GPIO_Port GPIOF
#define LCD_TEXT_D7_Pin GPIO_PIN_7
#define LCD_TEXT_D7_GPIO_Port GPIOF
#define LCD_TEXT_V0_Pin GPIO_PIN_8
#define LCD_TEXT_V0_GPIO_Port GPIOF
#define LCD_TEXT_D6_Pin GPIO_PIN_9
#define LCD_TEXT_D6_GPIO_Port GPIOF
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOH
#define RMII_MDC_Pin GPIO_PIN_1
#define RMII_MDC_GPIO_Port GPIOC
#define RMII_REF_CLK_Pin GPIO_PIN_1
#define RMII_REF_CLK_GPIO_Port GPIOA
#define RMII_MDIO_Pin GPIO_PIN_2
#define RMII_MDIO_GPIO_Port GPIOA
#define RMII_CRS_DV_Pin GPIO_PIN_7
#define RMII_CRS_DV_GPIO_Port GPIOA
#define RMII_RXD0_Pin GPIO_PIN_4
#define RMII_RXD0_GPIO_Port GPIOC
#define RMII_RXD1_Pin GPIO_PIN_5
#define RMII_RXD1_GPIO_Port GPIOC
#define LD1_Pin GPIO_PIN_0
#define LD1_GPIO_Port GPIOB
#define HC_SR04_TRIG_Pin GPIO_PIN_13
#define HC_SR04_TRIG_GPIO_Port GPIOF
#define LCD_TEXT_D4_Pin GPIO_PIN_0
#define LCD_TEXT_D4_GPIO_Port GPIOG
#define LCD_TEXT_D5_Pin GPIO_PIN_1
#define LCD_TEXT_D5_GPIO_Port GPIOG
#define KEYPAD_IN_1_Pin GPIO_PIN_7
#define KEYPAD_IN_1_GPIO_Port GPIOE
#define KEYPAD_IN_0_Pin GPIO_PIN_8
#define KEYPAD_IN_0_GPIO_Port GPIOE
#define HC_SR04_ECHO_Pin GPIO_PIN_9
#define HC_SR04_ECHO_GPIO_Port GPIOE
#define KEYPAD_IN_2_Pin GPIO_PIN_10
#define KEYPAD_IN_2_GPIO_Port GPIOE
#define KEYPAD_IN_3_Pin GPIO_PIN_12
#define KEYPAD_IN_3_GPIO_Port GPIOE
#define KEYPAD_OUT_0_Pin GPIO_PIN_14
#define KEYPAD_OUT_0_GPIO_Port GPIOE
#define KEYPAD_OUT_1_Pin GPIO_PIN_15
#define KEYPAD_OUT_1_GPIO_Port GPIOE
#define KEYPAD_OUT_2_Pin GPIO_PIN_10
#define KEYPAD_OUT_2_GPIO_Port GPIOB
#define KEYPAD_OUT_3_Pin GPIO_PIN_11
#define KEYPAD_OUT_3_GPIO_Port GPIOB
#define RMII_TXD1_Pin GPIO_PIN_13
#define RMII_TXD1_GPIO_Port GPIOB
#define LD3_Pin GPIO_PIN_14
#define LD3_GPIO_Port GPIOB
#define STLK_RX_Pin GPIO_PIN_8
#define STLK_RX_GPIO_Port GPIOD
#define STLK_TX_Pin GPIO_PIN_9
#define STLK_TX_GPIO_Port GPIOD
#define USB_PowerSwitchOn_Pin GPIO_PIN_6
#define USB_PowerSwitchOn_GPIO_Port GPIOG
#define USB_OverCurrent_Pin GPIO_PIN_7
#define USB_OverCurrent_GPIO_Port GPIOG
#define USB_SOF_Pin GPIO_PIN_8
#define USB_SOF_GPIO_Port GPIOA
#define USB_VBUS_Pin GPIO_PIN_9
#define USB_VBUS_GPIO_Port GPIOA
#define USB_ID_Pin GPIO_PIN_10
#define USB_ID_GPIO_Port GPIOA
#define USB_DM_Pin GPIO_PIN_11
#define USB_DM_GPIO_Port GPIOA
#define USB_DP_Pin GPIO_PIN_12
#define USB_DP_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define LCD_TEXT_RS_Pin GPIO_PIN_0
#define LCD_TEXT_RS_GPIO_Port GPIOD
#define LCD_TEXT_E_Pin GPIO_PIN_1
#define LCD_TEXT_E_GPIO_Port GPIOD
#define ST7735S_DC_Pin GPIO_PIN_3
#define ST7735S_DC_GPIO_Port GPIOD
#define RMII_TX_EN_Pin GPIO_PIN_11
#define RMII_TX_EN_GPIO_Port GPIOG
#define RMII_TXD0_Pin GPIO_PIN_13
#define RMII_TXD0_GPIO_Port GPIOG
#define LD2_Pin GPIO_PIN_7
#define LD2_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
